# Pandas(Panel Datas)

##### Pandas package import

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
titanic = sns.load_dataset("titanic")

## Series class

#### Series 생성하기  
-pandas.Serise
```python
class pandas.Seies(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)
```

In [406]:
series = pd.Series(["하나","둘","셋","넷","다섯",
                    "여섯","일곱","여덟","아홉","열"],
                   index = [_ for _ in range(1,11)])
series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [407]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [408]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [409]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [410]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [411]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [412]:
d = {'a': 1,'b': 2,'c': 3}
ser = pd.Series(data=d, index=['a','b','c'])
ser

a    1
b    2
c    3
dtype: int64

In [413]:
d = {'a': 1,'b': 2,'c': 3}
ser = pd.Series(data=d, index=['x','y','z'])
ser # NaN 값이 float자료형에서만 표현이 가능하므로 결과가 float자료형이 되었다.

x   NaN
y   NaN
z   NaN
dtype: float64

In [414]:
s2 = pd.Series({"서울":9_904_312,
                "부산":3_448_737,
                "인천":2_890_451,
                "대구":2_466_052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

#### Series index를 속성처럼 활용하기

In [415]:
d = {'a':1,'b':2,'c':3}
ser = pd.Series(data=d,index=['a','b','c'])
ser

a    1
b    2
c    3
dtype: int64

In [416]:
ser.a, ser.b, ser.c

(1, 2, 3)

#### Series의 특징

In [417]:
"서울" in s # 인덱스 레이블 중에 서울이 있는가

True

In [418]:
"대전" in s # 인덱스 레이블 중에 대전이 있는가

False

In [419]:
for k, v in s.items():
    print(f"{k}, {v}")

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

#### Series 연산하기

In [420]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [421]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

#### Series 인덱싱

In [422]:
s[1], s["부산"]

(3448737, 3448737)

In [423]:
s[3], s["대구"]

(2466052, 2466052)

In [424]:
s[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [425]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

#### Series 슬라이싱

In [426]:
s[1:3] # 두번째 (1)부터 세번째 (2)까지 (네번째(3) 미포함)

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [427]:
s["부산":"대구"] # 부산에서 대구까지 (대구도 포함)

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

#### Series index 기반 연산

In [428]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [429]:
s2 = pd.Series({"서울": 9631482,"부산":3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [430]:
ds = s -s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

#### Series에서 값이 NaN인지 확인

In [431]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

#### Series에서 NaN이 아닌 값 구하기

In [432]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [433]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [434]:
s # 2015년 도시별 인구

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [435]:
s2 # 2010년 도시별 인구

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [436]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

#### Series 데이터 추가, 갱신, 삭제

In [437]:
rs # 인구 증가율(%)

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [438]:
rs["부산"] = 1.63 # 갱신
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [439]:
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [440]:
rs["대구"] = 1.41 # 추가
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [441]:
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [442]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

#### Series 데이터 개수 세기

In [443]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [444]:
s.count()

9

In [445]:
len(s)

10

In [446]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [447]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [448]:
# seaborn 이라는 패키지에는 여러가지 데이터를 제공하고 있습니다.
# 그 중 타이타닉호의 승객 데이터도 있는데 아래의 예제처럼 DataFrame으로 읽어올 수 있습니다.
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head(5) # 데이터 중 앞의 5개를 봅니다.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### Series 카테고리 값세기

In [449]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [450]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

### Series 정렬

#### Series 정렬 - index기준

In [451]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [452]:
# sort_index를 적용하면 아래와 같이 정렬된 결과를 볼 수 있습니다.
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

#### Series 정렬 - value기준

In [453]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [454]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

#### Series 정렬 - 내림차순

In [455]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

### Series class 연습문제

##### 아래 fin1과  fin2_value, fin2_index를 활용하여  
Series 객체 ser_finance1, ser_finaance2를 만들어 보세요.  
fin1 = {"카카오":60010, "삼성전자":61000,"LG전자":90000}  
fin2_value = [60200,61200,200100]  
fin2_index = ["카카오", "삼성전자", "네이버"]

In [456]:
fin1 = {"카카오":60010,"삼성전자":61000,"LG전자":90000}
fin2_value = [60200,61200,200100]
fin2_index = ["카카오", "삼성전자", "네이버"]
ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value,fin2_index)

##### 앞서 만든 두 Series 객체를 활용하여 사칙 연산을 각각 수행해보세요.  
사칙연산 중 NaN 값을 갖는 항목과 dtype을 각각 확인해보세요.  
왜 해당 dtype이 나오는지 설명하세요.

In [457]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [458]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [459]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [460]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

##### 아래의 연산 결과 중 NaN 값이 없게 Series 객체를 출력해보세요.  
```python
result = ser_finance1 - ser_finance2
```

In [461]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

##### 타이타닉호 승객 데이터를 seaborn 패키지를 통해 불러오고,  
그 데이터 개수를 각 column마다 구해보세요.

In [462]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## DataFrame class

- pandas.DataFrame
```python
class pandas.DataFrame(data=None, index=None, column=None, dtype=None, copy=None)
```

### DataFrame 생성하기

- 우선 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비합니다.
- 이 각각의 열에 대한 이름을 키로 가지는 딕셔너리를 만듭니다.
- 이 데이터를 DataFrame 클래스 생성자에 넣는다.  
동시에 열방향 index는 columns인수로, 행방향 index는 index 인수로 지정합니다

In [463]:
d = {'col1': [1,2], 'col2':[3,4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [464]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762564, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경산권", "수도권", "경상권"],
    "2010-2015 증가율" : [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762564  9853972         0.0283
부산  경산권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

#### DataFrame의 속성 values, columns, index

In [465]:
df.values

array([['수도권', 9904312, 9631482, 9762564, 9853972, 0.0283],
       ['경산권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [466]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [467]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

#### DataFrame에 이름 붙이기

In [468]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972         0.0283
부산  경산권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

#### DataFeame 전치

In [469]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경산권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762564  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

#### DataFrame column 추가, 갱신, 삭제

In [470]:
# "2010-2015 증가율"이라는 이름의 열의 값을 갱신
df["2010-2015 증가율"] = df["2010-2015 증가율"] *100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972           2.83
부산  경산권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [471]:
# "2005-2010 증가율"이라는 이름의 열 추가
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972           2.83          -1.34
부산  경산권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [472]:
# "2010-2015 증가율"이라는 이름의 열 삭제
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972          -1.34
부산  경산권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

#### DataFrame row 슬라이싱

In [473]:
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972          -1.34
부산  경산권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [474]:
df[:1] # df[:"서울"] --> 문자는 포함, 숫자는 미포함

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972          -1.34

In [475]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경산권  3448737  3393191  3512547  3655437           -3.4

In [476]:
df["부산":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경산권  3448737  3393191  3512547  3655437           -3.4

### DataFrame 인덱싱

#### DataFrame column 인덱싱

In [477]:
# 하나의 column만 인덱싱 하면 Series가 반환된다.
df["지역"]

도시
서울    수도권
부산    경산권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [478]:
# 2010이라는 column을 반환하면서 Series 자료형으로 변환
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [479]:
type(df["2010"])

pandas.core.series.Series

In [480]:
# 여러 개의 column을 인덱싱하면 부분적인 DataFrame이 반환된다.
df[["2010","2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [485]:
# 2010이라는 column을 반환하면서 DataFrame 자료형을 유지
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [486]:
# column index가 문자열 label일 때 는 순서를 나타내는 정수 index를 column 인덱싱에 사용할 수 없습니다.
df[0]

KeyError: 0

In [487]:
import numpy as np
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [488]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

In [489]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

#### DataFrame row를 인덱싱 할 경우

In [490]:
df["서울"]

KeyError: '서울'

#### DataFrame 개별 데이터 인덱싱

In [491]:
df["2015"]["서울"]

9904312

In [492]:
type(df["2015"]["서울"])

numpy.int64

#### DataFrame 개별 데이터 인덱싱, 역순은 안 될까?

In [493]:
df["서울":"서울"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972          -1.34

In [494]:
df["서울":"서울"]["2015"] # 효율적이지 않음

도시
서울    9904312
Name: 2015, dtype: int64

In [495]:
type(df["서울":"서울"]["2015"])

pandas.core.series.Series

#### DataFrame 고급 인덱싱

Pandas는 Numpy 배열과 같이 콤마를 사용한 (row인덱스, column인덱스)  
형식의 2차원 인덱싱을 지원하기 위해
다음과 같은 특별한 인덱서 속성도 제공합니다.  
- ioc : label 값 기반의 2차원 인덱싱  
- iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

##### DataFrame 고급 인덱싱 - loc 인덱서
이 때 인덱싱 값은 다음 중 하나입니다. row 인덱싱 값은 정수 또는 row index 데이터이고 column 인덱싱 값은 label 문자열입니다.  
- index 데이터
- index 데이터 슬라이스
- index 데이터 리스트
- 같은 row 인덱스를 가지는 boolean Series (row 인덱싱의 경우)
- 또는 위의 값들을 반환하는 함수

##### loc인덱서는 다음과 같이 사용할 수 있습니다.  
- df.loc[row 인덱싱 값, column 인덱싱 값]  
- df.loc[row 인덱싱 값]

In [496]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4), index=list("abc"), columns=list("ABCD"))
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [497]:
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [498]:
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [499]:
df.loc["a":"c"]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [500]:
df.loc[["b","c"]]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [501]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [502]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [503]:
# callable한 함수를 만들어서 인덱싱하는데 사용할 수 있습니다.
def select_rows(df, num):
    return df.A > num

In [504]:
select_rows(df, 10)

a    False
b     True
c     True
Name: A, dtype: bool

In [505]:
df.loc[select_rows(df, 10)]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [506]:
# loc 인덱서는 column label 인덱싱이나 column label 리스트 인덱싱은 불가능합니다.
df.loc["A"] # KeyError

KeyError: 'A'

In [507]:
# loc 인덱서는 column label 인덱싱이나 column label 리스트 인덱싱은 불가능합니다.
df.loc[["A","B"]] # KeyError

KeyError: "None of [Index(['A', 'B'], dtype='object')] are in the [index]"

In [508]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4,4),columns=["A","B","C","D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [509]:
# 원래 row 인덱스 값이 정수인 경우에는 마지막 값이 포합됩니다.
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [510]:
df.loc["a","A"]

10

In [511]:
df.loc["b":,"A"]

b    14
c    18
Name: A, dtype: int32

In [512]:
df.loc["a",:]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [513]:
df.loc[["a","b"],["B","D"]]

    B   D
a  11  13
b  15  17

In [179]:
df.loc[df.A > 10, ["C","D"]]

    C   D
b  16  17
c  20  21

##### DataFrame 고급 인덱싱 - iloc 인덱서
loc인덱서와 반대로 label이 아니라 순서를 나타내는 정수(integer) 인덱스만 받습니다.  
다른 사항은 loc인덱서와 같습니다.

In [514]:
df.iloc[0,1]

11

In [515]:
df.iloc[:2,2]

a    12
b    16
Name: C, dtype: int32

In [516]:
df.iloc[0,-2:]

C    12
D    13
Name: a, dtype: int32

In [517]:
df.iloc[2:3,1:3]

    B   C
c  19  20

In [518]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [519]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

##### DataFrame 고급 인덱싱 - loc 인덱서 vs iloc 인덱서

In [520]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [521]:
df2.iloc[1:2]

    A   B   C   D
1  14  15  16  17

### DataFrame 카테고리 값세기

In [522]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [523]:
df[0].value_counts()

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [524]:
df3 = pd.DataFrame(np.ones((3,4)), columns=list('가나다라'))
df['나'] = 2.0
df3.iloc[1,2] = 3.0
df3.iloc[2,3] = np.nan
df3

     가    나    다    라
0  1.0  1.0  1.0  1.0
1  1.0  1.0  3.0  1.0
2  1.0  1.0  1.0  NaN

In [525]:
df3.value_counts(['가','다'])

가    다
1.0  1.0    2
     3.0    1
dtype: int64

In [526]:
df3.value_counts(['가','라'])

가    라
1.0  1.0    2
dtype: int64

### DataFrame 정렬

In [527]:
df.sort_values(by=1)

     0    1    2    3    나
0  0.0  0.0  3.0  2.0  2.0
1  3.0  0.0  2.0  1.0  2.0
2  3.0  2.0  4.0  NaN  2.0
3  4.0  3.0  4.0  2.0  2.0

- by 키워드 인수에 전달할 값으로 리스트 자료형의 형태로 지정할 수 있습니다.
- 요소의 순서대로 정렬 기준의 우선순위가 됩니다.

In [528]:
df.sort_values(by=[1,2])

     0    1    2    3    나
1  3.0  0.0  2.0  1.0  2.0
0  0.0  0.0  3.0  2.0  2.0
2  3.0  2.0  4.0  NaN  2.0
3  4.0  3.0  4.0  2.0  2.0

### DataFrame 행/열 합계

In [529]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [530]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [531]:
df2["Rowsum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  Rowsum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [532]:
df2.loc["colTotal"] = df2.sum()
df2

           0   1   2   3   4   5  6   7  Rowsum
0          5   8   9   5   0   0  1   7      35
1          6   9   2   4   5   2  4   2      34
2          4   7   7   9   1   7  0   6      41
3          9   9   7   6   9   1  0   1      42
colTotal  24  33  25  24  15  10  5  16     152

In [533]:
df2.loc["colTotal",:] = df2.sum()
df2

           0   1   2   3   4   5   6   7  Rowsum
0          5   8   9   5   0   0   1   7      35
1          6   9   2   4   5   2   4   2      34
2          4   7   7   9   1   7   0   6      41
3          9   9   7   6   9   1   0   1      42
colTotal  48  66  50  48  30  20  10  32     304

In [534]:
df2.mean()

0         14.4
1         19.8
2         15.0
3         14.4
4          9.0
5          6.0
6          3.0
7          9.6
Rowsum    91.2
dtype: float64

In [535]:
df2.loc["colTotal", :] = df2.mean()
df2

             0     1   2     3  4  5  6    7  Rowsum
0          5.0   8.0   9   5.0  0  0  1  7.0    35.0
1          6.0   9.0   2   4.0  5  2  4  2.0    34.0
2          4.0   7.0   7   9.0  1  7  0  6.0    41.0
3          9.0   9.0   7   6.0  9  1  0  1.0    42.0
colTotal  14.4  19.8  15  14.4  9  6  3  9.6    91.2

### DataFrame 메서드

#### DataFrame apply() 메서드

In [45]:
df = pd.DataFrame([[4,9]] * 3, columns = ['A','B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [46]:
df.apply(np.sqrt)
np.sqrt(df)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [47]:
# axis가 0일 때 각 column별 집계합니다.
df.apply(np.sum, axis=0)

A    12
B    27
dtype: int64

In [49]:
# axis가 1일 때 각 row 별 집계합니다.
df.apply(np.sum, axis=1)

0    13
1    13
2    13
dtype: int64

In [50]:
df.apply(lambda x: [1,2], axis=0)

   A  B
0  1  1
1  2  2

In [52]:
df.apply(lambda x: [1,2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [53]:
df.apply(lambda x: [1,2], axis=1, result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2

In [58]:
df.apply(lambda x: pd.Series([1,2],index=['foo','bar']), axis=1)

   foo  bar
0    1    2
1    1    2
2    1    2

In [60]:
# result_type='broadcast'를 인수로 전달하면 동일한 shape의 결과를 보장합니다.
#결과의 column label은 본래의 column label을 유지합니다.
df.apply(lambda x: [1,2], axis=1, result_type='broadcast')

   A  B
0  1  2
1  1  2
2  1  2

In [62]:
# 함수로부터 return되는 값이 기존 shape으로 브로드캬스트 할 수 없는 shape이라면 Value Error가 발생됩니다.
df.apply(lambda x: [1,2,3], axis=1, result_type='broadcast')

ValueError: cannot broadcast result

In [63]:
df3 = pd.DataFrame({
    'A' : [1,3,4,3,4],
    'B' : [2,3,1,2,3],
    'C' : [1,5,2,4,4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [64]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [65]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [66]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [81]:
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

#### DataFrame fillna() 메서드

##### filna() 메서드를 사용하여 NaN값을 원하는 값으로 바꿀 수 있습니다

In [141]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                  [3, 4, np.nan,1],
                  [np.nan, np.nan, np.nan, np.nan],
                  [np.nan, 3, np.nan, 4]],
                  columns =list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [137]:
df.fillna(0)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

In [143]:
values = {"A": 0, "B": 1, "C": 2, "D": 3}
df.fillna(value=values)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

In [144]:
values = {"A": 0, "B": 1, "C": 2, "D": 3}
df.fillna(value=values, limit=1)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  NaN  1.0
2  NaN  1.0  NaN  3.0
3  NaN  3.0  NaN  4.0

In [146]:
df2 = pd.DataFrame(np.zeros((3,4)), columns=list('ABCE'))
df.fillna(df2)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  NaN
3  NaN  3.0  NaN  4.0

#### DataFrame astype() 메서드

In [162]:
d = {'col1':[1,2],'col2':[3,4]}
df = pd.DataFrame(data=d)
df.dtypes

col1    int64
col2    int64
dtype: object

In [163]:
df.astype('int32').dtypes

col1    int32
col2    int32
dtype: object

In [165]:
df.astype({'col1':'int32'}).dtypes

col1    int32
col2    int64
dtype: object

### DataFrame 실수 값을 카테고리 값으로 변환

#### 실수 값을 크기 기준으로 하여 카테고리 값으로 변환하고 싶을 때는 다음과 같은 명령을 사용합니다.
- cut: 실수 값의 경계선을 지정하는 경우
    - x = 1차원 형태의 배열 형태가 옵니다.
    - bins = int, 스칼라를 요소로 갖는 시퀀스가 옵니다.
- qcut: 개수가 똑같은 구간으로 나누는 경우(분위수)
    - x = 1d ndarray 혹은 Series
    - bins = int 혹은 분위수를 나타내는 1.이하의 실수를 요소로 갖는 list(e.g.[0, .25, .5, .75, 1.])

##### cut

In [261]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [262]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]
cats = pd.cut(ages,bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '중년', '미성년자', '장년', '장년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '장년' < '중년' < '노년']

In [263]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [266]:
cats.categories

Index(['미성년자', '청년', '장년', '중년', '노년'], dtype='object')

In [267]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [272]:
df4 = pd.DataFrame(ages, columns=['ages'])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      장년
7     61      중년
8     20    미성년자
9     41      장년
10    32      장년
11   101     NaN

In [273]:
df4.dtypes

ages          int64
age_cat    category
dtype: object

In [274]:
df4["age_cat"].astype(str) + df4["ages"].astype(str)

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       장년37
6       장년31
7       중년61
8     미성년자20
9       장년41
10      장년32
11    nan101
dtype: object

##### qcut

In [278]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1","Q2","Q3","Q4"])
cats

['Q3', 'Q2', 'Q3', 'Q4', 'Q1', ..., 'Q1', 'Q2', 'Q2', 'Q3', 'Q4']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [280]:
pd.value_counts(cats)

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

### DataFrame 인덱스

#### DataFrame 인덱스 설정 및 제거

##### 
- set_index : 기존의 row 인덱스를 제거하고 데이터 column 중 하나를 인덱스로 설정합니다.
- reset_index : 기존의 row 인덱스를 제거하고 인덱스를 데이터 열로 추가합니다.

In [373]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3,5), 2)]).T,
                   columns=["c1","c2","c3","c4"])
df1

  c1    c2    c3    c4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [374]:
df2 = df1.set_index("c1")
df2

      c2    c3    c4
c1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [375]:
df2.set_index("c2")

        c3    c4
c2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [376]:
df2.reset_index()

  c1    c2    c3    c4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [385]:
df2.reset_index(drop=True)

     c2    c3    c4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

#### DataFrame 다중 인덱스

In [12]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5,4), 2),
                   columns = [["A", "A", "B", "B"],
                             ["C1", "C2", "C1", "C2"]])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [13]:
df3.columns.names = ["Cidx1", "Cidx2"]
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [14]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[['A', 'A', 'B', 'B'],
                           ['C', 'D', 'C', 'D']],
                   index=[['M', 'M', 'M', 'F', 'F', 'F'],
                          ['id_' + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ['Cidx1', 'Cidx2']
df4.index.names = ['Ridx1', 'Ridx2']
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

#### DataFrame row 인덱스와 column 인덱스 교환

##### 
- stack() 메서드: column 인덱스 -> row 인덱스로 변환

- unstack() 메서드: row 인덱스 -> column 인덱스로 변환

In [15]:
df4.stack('Cidx1')

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

In [16]:
df4.unstack('Ridx2')

Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.76  1.49 -2.55  0.12 -0.21  0.65  0.44  0.31  0.86  0.33 -0.85 -0.74
M      1.76  1.87 -0.10  0.40 -0.98  0.41  0.98  0.95  0.14  2.24 -0.15  1.45

In [18]:
df4.stack(0)

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

#### DataFrame 다중 인덱스가 있는 경우의 인덱싱

In [19]:
df3[("B","C1")]

0    0.98
1    0.95
2    0.14
3    0.44
4    0.31
Name: (B, C1), dtype: float64

In [20]:
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [21]:
df3.loc[0,("B","C1")]

0.98

In [22]:
df3.loc[0,("B","C1")] = 100
df3

Cidx1     A             B
Cidx2    C1    C2      C1    C2
0      1.76  0.40  100.00  2.24
1      1.87 -0.98    0.95 -0.15
2     -0.10  0.41    0.14  1.45
3      0.76  0.12    0.44  0.33
4      1.49 -0.21    0.31 -0.85

In [23]:
df3.iloc[0,2]

100.0

In [24]:
df3['A']

Cidx2    C1    C2
0      1.76  0.40
1      1.87 -0.98
2     -0.10  0.41
3      0.76  0.12
4      1.49 -0.21

In [25]:
df4.loc[("M", "id_1"), ("A", "C")]

1.76

In [26]:
df4.loc[:, ("A", "C")]

Ridx1  Ridx2
M      id_1     1.76
       id_2     1.87
       id_3    -0.10
F      id_1     0.76
       id_2     1.49
       id_3    -2.55
Name: (A, C), dtype: float64

In [27]:
df4.loc[("M", "id_1"), :]

Cidx1  Cidx2
A      C        1.76
       D        0.40
B      C        0.98
       D        2.24
Name: (M, id_1), dtype: float64

In [28]:
df4.loc[("All", "All"), :] = df4.sum()
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [30]:
df4.loc["M"]

Cidx1     A           B
Cidx2     C     D     C     D
Ridx2
id_1   1.76  0.40  0.98  2.24
id_2   1.87 -0.98  0.95 -0.15
id_3  -0.10  0.41  0.14  1.45

In [31]:
df4.loc[("M", slice(None)),:]

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45

In [32]:
df4.loc[(slice(None), "id_1"),:]

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
F     id_1   0.76  0.12  0.44  0.33

#### DataFrame 다중 인덱스의 인덱스 순서 교환

##### 다중 인덱스의 인덱스 순서를 바꾸고 싶으면 swaplevel 명령을 사용합니다.
- swaplevel(i, j, axis)  
i와 j는 교환하고자 하는 인덱스 label(혹은 인덱스 번호)이고  
axis는 0일 때 row 인덱스,1일 때 column 인덱스를 뜻합니다.  
디폴트는 행 인덱스입니다.

In [34]:
df6 = df4.swaplevel("Cidx1", "Cidx2", 1)
df6

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [35]:
df5 = df4.swaplevel("Ridx1", "Ridx2")
df5

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

#### DataFrame 다중 인덱스가 있는 경우의 정렬

In [37]:
df5.sort_index(level=0)

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
All   All    3.23  0.39  3.68  2.28
id_1  F      0.76  0.12  0.44  0.33
      M      1.76  0.40  0.98  2.24
id_2  F      1.49 -0.21  0.31 -0.85
      M      1.87 -0.98  0.95 -0.15
id_3  F     -2.55  0.65  0.86 -0.74
      M     -0.10  0.41  0.14  1.45

In [38]:
df6.sort_index(axis=1,level=0)
df6

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

### DataFrame 합성

##### pandas는 두 개 이상의 DataFrame을 하나로 합치는 데이터 병합(merge)이나 연결(concatenate)을 지원합니다.

#### DataFrame merge()

In [536]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [540]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [541]:
pd.merge(df1,df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [544]:
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [545]:
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [546]:
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

In [40]:
df1 = pd.DataFrame({
    '품종': ['setosa', 'setosa', 'virginica', 'virginica'],
    '꽃잎길이': [1.4, 1.3, 1.5, 1.3]},
    columns=['품종', '꽃잎길이'])
df1

          품종  꽃잎길이
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [44]:
df2 = pd.DataFrame({
    '품종': ['setosa', 'virginica', 'virginica', 'versicolor'],
    '꽃잎너비': [0.4, 0.3, 0.5, 0.3]},
    columns=['품종', '꽃잎너비'])
df2

           품종  꽃잎너비
0      setosa   0.4
1   virginica   0.3
2   virginica   0.5
3  versicolor   0.3

In [45]:
pd.merge(df1, df2)

          품종  꽃잎길이  꽃잎너비
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

### DataFrame 시계열 자료 다루기 DatatimeIndex

#### freq 인수로 특정한 날짜만 생성되도록 할 수도 있습니다. 많이 사용되는 freq 인수값은 다음과 같습니다.
- s: 초
- T: 분
- H: 시간
- D: 일(day)
- B: 주말이 아닌 평일
- W: 주(일요일)
- W-MON: 주(월요일)
- M: 각 달(month)의 마지막 날
- MS: 각 달의 첫날
- BM: 주말이 아닌 평일 중에서 각 달의 마지막 날
- BMS: 주말이 아닌 평일 중에서 각 달의 첫날
- WOM-2THU: 각 달의 두번째 목요일
- Q-JAN: 각 분기의 첫달의 마지막 날
- Q-DEC: 각 분기의 마지막 달의 마지막 날

In [52]:
date_str = ["2018, 1, 1", "2018, 1, 4", "2018, 1, 5", "2018, 1, 6"]
idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2018-01-01', '2018-01-04', '2018-01-05', '2018-01-06'], dtype='datetime64[ns]', freq=None)

In [53]:
np.random.seed(0)
s = pd.Series(np.random.randn(4), index=idx)
s

2018-01-01    1.764052
2018-01-04    0.400157
2018-01-05    0.978738
2018-01-06    2.240893
dtype: float64

In [54]:
pd.date_range("2018-4-1", "2018-4-30")

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06', '2018-04-07', '2018-04-08',
               '2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12',
               '2018-04-13', '2018-04-14', '2018-04-15', '2018-04-16',
               '2018-04-17', '2018-04-18', '2018-04-19', '2018-04-20',
               '2018-04-21', '2018-04-22', '2018-04-23', '2018-04-24',
               '2018-04-25', '2018-04-26', '2018-04-27', '2018-04-28',
               '2018-04-29', '2018-04-30'],
              dtype='datetime64[ns]', freq='D')

In [55]:
pd.date_range(start="2018-4-1", periods=30)

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06', '2018-04-07', '2018-04-08',
               '2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12',
               '2018-04-13', '2018-04-14', '2018-04-15', '2018-04-16',
               '2018-04-17', '2018-04-18', '2018-04-19', '2018-04-20',
               '2018-04-21', '2018-04-22', '2018-04-23', '2018-04-24',
               '2018-04-25', '2018-04-26', '2018-04-27', '2018-04-28',
               '2018-04-29', '2018-04-30'],
              dtype='datetime64[ns]', freq='D')

In [56]:
pd.date_range("2018-4-1", "2018-4-30", freq="B")

DatetimeIndex(['2018-04-02', '2018-04-03', '2018-04-04', '2018-04-05',
               '2018-04-06', '2018-04-09', '2018-04-10', '2018-04-11',
               '2018-04-12', '2018-04-13', '2018-04-16', '2018-04-17',
               '2018-04-18', '2018-04-19', '2018-04-20', '2018-04-23',
               '2018-04-24', '2018-04-25', '2018-04-26', '2018-04-27',
               '2018-04-30'],
              dtype='datetime64[ns]', freq='B')

In [57]:
pd.date_range("2018-1-1", "2018-12-31", freq="W")

DatetimeIndex(['2018-01-07', '2018-01-14', '2018-01-21', '2018-01-28',
               '2018-02-04', '2018-02-11', '2018-02-18', '2018-02-25',
               '2018-03-04', '2018-03-11', '2018-03-18', '2018-03-25',
               '2018-04-01', '2018-04-08', '2018-04-15', '2018-04-22',
               '2018-04-29', '2018-05-06', '2018-05-13', '2018-05-20',
               '2018-05-27', '2018-06-03', '2018-06-10', '2018-06-17',
               '2018-06-24', '2018-07-01', '2018-07-08', '2018-07-15',
               '2018-07-22', '2018-07-29', '2018-08-05', '2018-08-12',
               '2018-08-19', '2018-08-26', '2018-09-02', '2018-09-09',
               '2018-09-16', '2018-09-23', '2018-09-30', '2018-10-07',
               '2018-10-14', '2018-10-21', '2018-10-28', '2018-11-04',
               '2018-11-11', '2018-11-18', '2018-11-25', '2018-12-02',
               '2018-12-09', '2018-12-16', '2018-12-23', '2018-12-30'],
              dtype='datetime64[ns]', freq='W-SUN')

In [58]:
pd.date_range("2018-1-1", "2018-12-31", freq="W-MON")

DatetimeIndex(['2018-01-01', '2018-01-08', '2018-01-15', '2018-01-22',
               '2018-01-29', '2018-02-05', '2018-02-12', '2018-02-19',
               '2018-02-26', '2018-03-05', '2018-03-12', '2018-03-19',
               '2018-03-26', '2018-04-02', '2018-04-09', '2018-04-16',
               '2018-04-23', '2018-04-30', '2018-05-07', '2018-05-14',
               '2018-05-21', '2018-05-28', '2018-06-04', '2018-06-11',
               '2018-06-18', '2018-06-25', '2018-07-02', '2018-07-09',
               '2018-07-16', '2018-07-23', '2018-07-30', '2018-08-06',
               '2018-08-13', '2018-08-20', '2018-08-27', '2018-09-03',
               '2018-09-10', '2018-09-17', '2018-09-24', '2018-10-01',
               '2018-10-08', '2018-10-15', '2018-10-22', '2018-10-29',
               '2018-11-05', '2018-11-12', '2018-11-19', '2018-11-26',
               '2018-12-03', '2018-12-10', '2018-12-17', '2018-12-24',
               '2018-12-31'],
              dtype='datetime64[ns]', freq='W-MON')

In [59]:
pd.date_range("2018-4-1", "2018-12-31", freq="MS")

DatetimeIndex(['2018-04-01', '2018-05-01', '2018-06-01', '2018-07-01',
               '2018-08-01', '2018-09-01', '2018-10-01', '2018-11-01',
               '2018-12-01'],
              dtype='datetime64[ns]', freq='MS')

In [60]:
pd.date_range("2018-4-1", "2018-12-31", freq="M")

DatetimeIndex(['2018-04-30', '2018-05-31', '2018-06-30', '2018-07-31',
               '2018-08-31', '2018-09-30', '2018-10-31', '2018-11-30',
               '2018-12-31'],
              dtype='datetime64[ns]', freq='M')

In [61]:
pd.date_range("2018-4-1", "2018-12-31", freq="BMS")

DatetimeIndex(['2018-04-02', '2018-05-01', '2018-06-01', '2018-07-02',
               '2018-08-01', '2018-09-03', '2018-10-01', '2018-11-01',
               '2018-12-03'],
              dtype='datetime64[ns]', freq='BMS')

In [62]:
pd.date_range("2018-4-1", "2018-12-31", freq="BM")

DatetimeIndex(['2018-04-30', '2018-05-31', '2018-06-29', '2018-07-31',
               '2018-08-31', '2018-09-28', '2018-10-31', '2018-11-30',
               '2018-12-31'],
              dtype='datetime64[ns]', freq='BM')

In [64]:
pd.date_range("2018-1-1", "2018-12-31", freq="WOM-2THU")

DatetimeIndex(['2018-01-11', '2018-02-08', '2018-03-08', '2018-04-12',
               '2018-05-10', '2018-06-14', '2018-07-12', '2018-08-09',
               '2018-09-13', '2018-10-11', '2018-11-08', '2018-12-13'],
              dtype='datetime64[ns]', freq='WOM-2THU')

In [67]:
np.random.seed(0)
ts = pd.Series(np.random.randn(4), index=pd.date_range(
    "2018-1-1", periods=4, freq="M"))
ts

2018-01-31    1.764052
2018-02-28    0.400157
2018-03-31    0.978738
2018-04-30    2.240893
Freq: M, dtype: float64

In [68]:
ts.shift(1)

2018-01-31         NaN
2018-02-28    1.764052
2018-03-31    0.400157
2018-04-30    0.978738
Freq: M, dtype: float64

In [69]:
ts.shift(-1)

2018-01-31    0.400157
2018-02-28    0.978738
2018-03-31    2.240893
2018-04-30         NaN
Freq: M, dtype: float64

In [70]:
ts.shift(1, freq="M")

2018-02-28    1.764052
2018-03-31    0.400157
2018-04-30    0.978738
2018-05-31    2.240893
Freq: M, dtype: float64

In [71]:
ts.shift(1, freq="W")

2018-02-04    1.764052
2018-03-04    0.400157
2018-04-01    0.978738
2018-05-06    2.240893
dtype: float64

In [74]:
s = pd.Series(pd.date_range("2020-12-25", periods=100, freq="D"))
s

0    2020-12-25
1    2020-12-26
2    2020-12-27
3    2020-12-28
4    2020-12-29
        ...
95   2021-03-30
96   2021-03-31
97   2021-04-01
98   2021-04-02
99   2021-04-03
Length: 100, dtype: datetime64[ns]

In [75]:
s.dt.year

0     2020
1     2020
2     2020
3     2020
4     2020
      ...
95    2021
96    2021
97    2021
98    2021
99    2021
Length: 100, dtype: int64

In [76]:
s.dt.weekday

0     4
1     5
2     6
3     0
4     1
     ..
95    1
96    2
97    3
98    4
99    5
Length: 100, dtype: int64

In [77]:
s.dt.strftime("%Y년 %m월 %d일")

0     2020년 12월 25일
1     2020년 12월 26일
2     2020년 12월 27일
3     2020년 12월 28일
4     2020년 12월 29일
          ...
95    2021년 03월 30일
96    2021년 03월 31일
97    2021년 04월 01일
98    2021년 04월 02일
99    2021년 04월 03일
Length: 100, dtype: object

### DataFrame 그룹 연산 메서드

In [6]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A','A','B','B','A'],
    'key2': ['one','two','one','two','one'],
    'data1': [1,2,3,4,5],
    'data2': [10,20,30,40,50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [7]:
groups = df2.groupby(df2.key1)
groups

In [8]:
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [9]:
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [11]:
df2.data1.groupby(df2.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [12]:
df2.groupby(df2.key1)["data1"].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [14]:
df2.groupby(df2.key1).sum()["data1"]

key1
A    8
B    7
Name: data1, dtype: int64

In [15]:
df2.data1.groupby([df2.key1, df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [16]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [17]:
df1['인구'].groupby([df1['지역'], df1['연도']]).sum().unstack('연도')

연도      2005     2010      2015
지역
경상권  3512547  3393191   3448737
수도권  9762546  9894685  12794763

### dropna
- 결측지 제거

In [70]:
import pandas as pd
import numpy as np
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [71]:
titanic.dropna(subset=["age"], inplace=True)
titanic.count()

survived       714
pclass         714
sex            714
age            714
sibsp          714
parch          714
fare           714
embarked       712
class          714
who            714
adult_male     714
deck           184
embark_town    712
alive          714
alone          714
dtype: int64

### DataFrame 연습문제

#### 지금부터 인터넷 서핑을 통해 자신이 관심있는 데이터를 얻고,
아래 조건을 만족하는 DataFrame을 직점 만들어보세요!
- column의 개수와 row의 개수가 각각 4개 이상이어야 합니다.
- column에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 합니다.

In [160]:
data = {
    "2019" : [985, 983, 936, 898, 898],
    "2020" : [995, 990, 960, 910, 910],
    "2021" : [1020, 1018, 972, 926, 925],
    "2022" : [1041, 1040, 992, 956, 955],
    "2023" : [1072, 1071, 1023,987 ,986],
    "지역": ["수도권","수도권","수도권","경상권","경상권"],
}
columns = ["지역","2019","2020","2021","2022","2023"]
index = ["도쿄","가나가와","오사카","사이타마","아이지"]
minimum_wage = pd.DataFrame(data, index=index, columns=columns)
minimum_wage.T

        도쿄  가나가와   오사카 사이타마  아이지
지역     수도권   수도권   수도권  경상권  경상권
2019   985   983   936  898  898
2020   995   990   960  910  910
2021  1020  1018   972  926  925
2022  1041  1040   992  956  955
2023  1072  1071  1023  987  986

#### 다음 DataFrame을 활용하여 아래 문제를 해결해보세요.
- 모든 학생의 수학 점수를 Series로 나타낸다.
- 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
- 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
- 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
- 춘향의 점수를 DataFrame으로 나타낸다.
- 향단의 점수를 Series로 나타낸다.  
```python
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
```

In [189]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [190]:
df["수학"]
df[["국어","영어"]]
df["평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round()
df["영어"]["방자"] = 80
df["평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round()
df[:1]
df.T["향단"]
df

C:\Users\Playdata\AppData\Local\Temp\ipykernel_2276\1164272044.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

    국어  영어  수학  평균 점수
춘향  80  90  90   87.0
몽룡  90  70  60   73.0
향단  70  60  80   70.0
방자  30  80  70   60.0

#### 다음 DataFrame을 만들어보세요.
- 랜덤 시드는 0입니다.
- values는 넘파이 서브 패키지 중 random의 randn() 메서드를 사용하세요.
- pd.date_range("20130206", periods=날짜수)을 활용하세요.

In [161]:
np.random.seed(0)
dates = pd.date_range("20130226", periods=6)
df3 = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df3

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165

#### 타이타닉호 승객에 대해 성별(sex) 인원수,  나이별(age) 인원수, 선실별(class) 인원수,  
사망/생존 인원수를 구하고 sort_values 혹은 value_counts 메서드를 사용하여 내림차순으로 정렬해 보세요

In [30]:
titanic["sex"].value_counts().sort_values(ascending=False)

male      577
female    314
Name: sex, dtype: int64

In [31]:
titanic["age"].value_counts().sort_values(ascending=False)

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
66.00     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [29]:
titanic["class"].value_counts().sort_values(ascending=False)

Third     491
First     216
Second    184
Name: class, dtype: int64

In [309]:
titanic["alive"].value_counts().sort_values(ascending=False)

no     549
yes    342
Name: alive, dtype: int64

#### 다음 문제를 푸시오.
1. 타이타닉호 승객의 평균 나이를 구하세요.  
29.7  
2. 타이타닉호 승객중 여성 승객의 평균 나이를 구하세요.  
27.9
3. 타이타닉호 승객중 1등실(pclass==1)선실의 여성 승객의 평균 나이를 구하세요.  
34.6

In [163]:
round(titanic.age.mean(),1)

29.7

In [157]:
round(titanic.age[(titanic.sex == "female")].mean(),1)

27.9

In [158]:
round(titanic.age[(titanic.sex == "female") & (titanic.pclass == 1)].mean(),1)

34.6

In [140]:
titanic.loc[(titanic.sex == "female") & (titanic.pclass == 1)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,49.0,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

#### 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 column인 category1 열을 만들어보세요.
category1 카테고리는 다음과 같이 정의됩니다.
1. 20살이 넘으면 성별을 그대로 사용합니다.
2. 20살 미만이면 성별에 관계없이 "child"라고 합니다.

In [255]:
titanic["category1"] = titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis=1)
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
5,0,3,male,29.7,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,male
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,male
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,child
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,female
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child

#### 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이값이 되도록 titanic DataFrame을 고쳐라

In [252]:
index_agr_is_nan = titanic[titanic['age'].isna()].index
print(index_agr_is_nan)

Int64Index([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
            ...
            832, 837, 839, 846, 849, 859, 863, 868, 878, 888],
           dtype='int64', length=177)

In [253]:
titanic.fillna({'age': round(titanic['age'].mean(), 1)}, inplace=True)

In [254]:
titanic.iloc[index_agr_is_nan]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
5,0,3,male,29.7,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,child
17,1,2,male,29.7,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,child
19,1,3,female,29.7,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,child
26,0,3,male,29.7,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,child
28,1,3,female,29.7,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,child
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,29.7,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,child
863,0,3,female,29.7,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,child
868,0,3,male,29.7,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True,child
878,0,3,male,29.7,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,child
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child

In [193]:
values = {"age": round(titanic.age.mean(),1)}
titanic.fillna(value=values, inplace=True)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

#### 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 column인 category2 coulmn을 만들어보세요.  
category2 카테고리는 다음과 같이 정의됩니다.
1. 성별을 나타내는 문자열 male 또는 female로 시작합니다.
2. 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 옵니다.
3. 예를 들어 27살 남성은 male27.0 값이 됩니다.

In [256]:
titanic["category2"] = titanic.sex+titanic.age.astype(str)
titanic[['age','category2']]

      age   category2
0    22.0    male22.0
1    38.0  female38.0
2    26.0  female26.0
3    35.0  female35.0
4    35.0    male35.0
..    ...         ...
886  27.0    male27.0
887  19.0  female19.0
888  29.7  female29.7
889  26.0    male26.0
890  32.0    male32.0

[891 rows x 2 columns]

In [259]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,male22.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,female38.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,female26.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,female35.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,male35.0

#### 타이타닉호 승객을 '미성년자','청년','장년', '중년', '노년' 나이 그룹으로 나눕니다.  
그리고 각 나이 그룹의 승객 비율을 구합니다. 비울의 전체 합은 1이 되어야 합니다.

In [325]:
titanic["age_cut"] = pd.cut(titanic.age,bins,labels=labels)
v_count = titanic.age_cut.value_counts()
v_count/ v_count.sum()

청년      0.464082
장년      0.274800
미성년자    0.188141
중년      0.067275
노년      0.005701
Name: age_cut, dtype: float64

In [348]:
titanic["age_cut"] = pd.cut(titanic.age,bins,labels=labels)
titanic.age_cut.value_counts(True)
df_t_a = pd.DataFrame({"연령층" : titanic.age_cut.value_counts(),"연령비율" : titanic.age_cut.value_counts(True)})
df_t_a

      연령층      연령비율
청년    407  0.464082
장년    241  0.274800
미성년자  165  0.188141
중년     59  0.067275
노년      5  0.005701

#### 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 column인 category3을 만들어라.  
category3 카테고리는 다음과 같이 정의됩니다.
1. 20살 미만이면 성별에 관계없이 "미성년자"라고 합니다.
2. 20살 이상이면 나이에 따라 "청년","장년","중년","노년"을 구분하고 그 뒤에 성별을 나타내는 "남성","여성"을 붙인다.

In [399]:
import pandas as pd
import numpy as np
titanic = sns.load_dataset("titanic")
titanic["age"].fillna(titanic["age"].mean(),inplace=True)
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]

titanic["category3"] = pd.cut(titanic.age,bins,labels=labels)
titanic["category3"] = titanic.apply(lambda i: "미성년자" if i.age < 20 else i.category3
                                     +("남성" if i["sex"] == "male" else "여성"), axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category3
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,청년남성
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,장년여성
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,청년여성
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,장년여성
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,장년남성
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,청년남성
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,미성년자
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,청년여성
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,청년남성
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,장년남성

In [390]:
import pandas as pd
import numpy as np
titanic = sns.load_dataset("titanic")
titanic["age"].fillna(titanic["age"].mean(),inplace=True)
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]

titanic["연령층"] = pd.cut(titanic["age"],bins=bins,labels=labels)
titanic["category3"] = titanic.apply(lambda i: "미성년자" if i["age"] < 20 else i["연령층"]
                                     +("남성" if i["sex"] == "male" else "여성"), axis=1)
titanic[["연령층","age", "sex", "category3"]]

      연령층        age     sex category3
0      청년  22.000000    male      청년남성
1      장년  38.000000  female      장년여성
2      청년  26.000000  female      청년여성
3      장년  35.000000  female      장년여성
4      장년  35.000000    male      장년남성
..    ...        ...     ...       ...
886    청년  27.000000    male      청년남성
887  미성년자  19.000000  female      미성년자
888    청년  29.699118  female      청년여성
889    청년  26.000000    male      청년남성
890    장년  32.000000    male      장년남성

[891 rows x 4 columns]

#### 5명의 학생의 국어,영어,수학 점수를 나타내는 DataFrame을 다음과 같이 만듭니다.
1. "이름" column을 인덱스로 만들어보세요.
2. 1에서 인덱스로 만든 "이름"을 다시 column으로 복원하세요.

In [1]:
score = {
    "이름":["일식", "이식", "삼식", "사식", "오식"],
    "국어":[60, 70, 90, 80, 100],
    "영어":[70, 86, 82, 88, 100],
    "수학":[65, 82, 85, 90, 100]
}

In [4]:
df_score = pd.DataFrame(score)
df_score

   이름   국어   영어   수학
0  일식   60   70   65
1  이식   70   86   82
2  삼식   90   82   85
3  사식   80   88   90
4  오식  100  100  100

In [5]:
df_score2 = df_score.set_index("이름")
df_score2

     국어   영어   수학
이름
일식   60   70   65
이식   70   86   82
삼식   90   82   85
사식   80   88   90
오식  100  100  100

In [7]:
df_score2.reset_index()

   이름   국어   영어   수학
0  일식   60   70   65
1  이식   70   86   82
2  삼식   90   82   85
3  사식   80   88   90
4  오식  100  100  100

#### 타이타닉호 데이터셋을 불러옵니다. 그리고 alive라는 column의 값이 'no'면 False로 'yes'aus True로 변경해봅시다.
- change_boolean(value) 함수를 만듭니다. 이 함수는 value값이  
'yes'면 True를 반환하고 'no'면 False를 반환합니다.
- 만든 함수를 활용해서 타이타닉호 데이터 셋 중 alive라는 column의 값을  
'no'면 False로 'yes'면 True로 치환해서 boolean타입으로 변경해보세요

In [73]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()
def change_boolean(value):
    if value == 'yes':
        return True
    else:
        return False
titanic.alive = titanic.alive.apply(change_boolean)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,False,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,True,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,False,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,True,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,False,True

In [77]:
titanic.alive.unique()

array([False,  True])

#### 타이타닉호 데이터셋을 불러옵니다. 그리고 age에서 NaN인 값을 제거합니다,
adult_female column을 만들고 나이가 20이상이고 성별이 'female'인 값은  
True 아니면 False 값을 할당합니다.

In [87]:
import pandas as pd
import numpy as np
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [88]:
titanic = titanic[titanic.age.notnull()]
titanic['adult_female'] = (titanic.age >= 20) & (titanic.sex == 'female')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult_female
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,False

## Pandas 데이터 입출력

#### Pandas 데이터 csv로 출력하기

In [164]:
import pandas as pd
import numpy as np

In [165]:
data = {
    "c1" : [1,2,"누락"],
    "c2" : [1.11,"",3.33],
    "c3" : ["one","two","three"]
}
index = ['0','1','2']
columns = ["c1","c2","c3"]
df_csv = pd.DataFrame(data, index=index,columns=columns)
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [166]:
df_csv.to_csv("sample1.csv", index=False)

In [167]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [168]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [174]:
df_na_val.to_csv('sample5.txt', sep='|')

In [175]:
# na_rep 키워드 인수를 사용해서 NaN 표시값을 바꿀 수 있습니다.
df_na_val.to_csv('sample6.csv', na_rep='누락')

#### Pandas csv로 부터 데이터 입력하기

In [169]:
df_read = pd.read_csv("sample1.csv")
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [170]:
df_csv.to_csv("sample2.csv", index=False,header=False)
pd.read_csv('sample2.csv' , names=['c1','c2','c3'])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [171]:
pd.read_table('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [172]:
pd.read_csv('sample4.txt', skiprows=[0,1])#range(2)로 사용가능

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [173]:
# 데이터로 불러올 자려 안 특정한 값을 NaN으로 취급하고 싶으면 na_values안에 값을 넣습니다.
df_na_val = pd.read_csv('sample1.csv', na_values=["누락"])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

#### 온라인의 csv 파일 가져오기

In [263]:
# 특정 개수만 보고 싶다면 head() 메서드나 tail() 메서드를 사용하면 됩니다. 인수로 출력할 행의 수를 넣으면 됩니다.
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y